src/DataProcessors/уатПодборПараметровРасшифровкиПлатежа/уатПодборПараметровРасшифровкиПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>уатПодборПараметровРасшифровкиПлатежа</name>
  <comment>Подбор параметров расшифровки платежа (уат)</comment>
  <attributes>
    <name>ПлатежПоСуммеВзаиморасчетов</name>
    <comment>Определяет, будет ли пересчитываться сумма платежа при изменении суммы взаиморасчетов или наоборот</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоЗаявкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДляПодбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>ВидВзаиморасчетов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДвиженияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>(Общ) Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.уатРеализацияУслуг</types>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
        <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
        <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
        <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/уатВзаиморасчетыСКонтрагентами/уатВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВзаиморасчетыСКонтрагентами</name>
  <comment>(уат)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте управленческого учета с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <comment>Сделка</comment>
    <type>
      <types>DocumentRef.уатРеализацияУслуг</types>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
      <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
      <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
      <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВедениеВзаиморасчетовПоДоговорам/ВедениеВзаиморасчетовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВедениеВзаиморасчетовПоДоговорам</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДоговоруВЦелом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСчетам</name>
    <comment>По счетам</comment>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНаТС</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
    <comment>Используется для обмена с типовыми конфигурациями</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионеромНаЗакупку</name>
    <comment>Используется для обмена с типовыми конфигурациями</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/уатПлатежноеПоручениеВходящее/уатПлатежноеПоручениеВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатПлатежноеПоручениеВходящее</name>
  <basedOn>Document.уатРеализацияУслуг</basedOn>
  <basedOn>Document.уатСчетНаОплатуПокупателю</basedOn>
  <basedOn>Document.уатРекламация_уэ</basedOn>
  <registerRecords>AccumulationRegister.уатДвижениеДС</registerRecords>
  <registerRecords>AccumulationRegister.уатОстаткиДСУПодотчетныхЛиц</registerRecords>
  <registerRecords>AccumulationRegister.уатОстаткиДС</registerRecords>
  <registerRecords>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.уатПлатежныйКалендарь</registerRecords>
  <attributes>
    <name>БанковскийСчет</name>
    <comment>Банковский счет</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>Вид операции</comment>
    <type>
      <types>EnumRef.уатВидыОперацийПлатежноеПоручениеВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>Дата входящего документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>Договор контрагента</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>DocumentRef.уатРеализацияУслуг</types>
      <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
      <types>DocumentRef.уатРекламация_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>Номер входящего документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <comment>Основание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <comment>Приложение</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <comment>Принято от</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <comment>Расчетный документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <comment>Оплачено</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение организации.</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <comment>Договор контрагента</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.уатРеализацияУслуг</types>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
        <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>Курс взаиморасчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <comment>Сумма платежа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <comment>Кратность взаиморасчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <comment>Сумма взаиморасчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <comment>Статья движения денежных средств</comment>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/уатПодборПараметровРасшифровкиПлатежа/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СформироватьСписокДолгов(ОбработкаОбъект, СтруктураПараметров) Экспорт
	ДокументСсылка = СтруктураПараметров.ДокументСсылка;
	Организация = СтруктураПараметров.Организация;
	Контрагент = СтруктураПараметров.Контрагент;
	ВалютаДокумента = СтруктураПараметров.ВалютаДокумента;
	КурсДокумента = СтруктураПараметров.КурсДокумента;
	КратностьДокумента = СтруктураПараметров.КратностьДокумента;
	ТипЗадолженности = СтруктураПараметров.ТипЗадолженности;
	ДатаДок = СтруктураПараметров.ДатаДок;
	ЕстьПодбор = СтруктураПараметров.ЕстьПодбор;
	ДокументРасшифровкаПлатежа = СтруктураПараметров.ДокументРасшифровкаПлатежа;
		
	ТабРасшифровка = ОбработкаОбъект.РасшифровкаПлатежа.Выгрузить();
	ТабРасшифровка.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	флЕС = Константы.уатКонфигурацияДляЕС.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Из регистра "уатВзаиморасчетыСКонтрагентами" выбираем задолженности по договорам,
	// не ведущимся по расчетным документам
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
	|	РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
	|	ВЫБОР
	|		КОГДА РасчетыСКонтрагентамиОстатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|		ИНАЧЕ РасчетыСКонтрагентамиОстатки.Валюта
	|	КОНЕЦ КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ВзаиморасчетыОстатки
	|ИЗ
	|	РегистрНакопления.уатВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Контрагент = &Контрагент
	|				И (&Организация = НЕОПРЕДЕЛЕНО
	|					ИЛИ Организация = &Организация)
	|				И ДоговорКонтрагента.ВидДоговора = &ВидДоговора
	|				И &ОтборыПоДоговорам) КАК РасчетыСКонтрагентамиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеЗадолженности.ТипЗадолженности КАК ВидВзаиморасчетов,
	|	ТекущиеЗадолженности.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТекущиеЗадолженности.ВалютаВзаиморасчетов КАК Валюта,
	|	ТекущиеЗадолженности.Сделка КАК Сделка,
	|	ТекущиеЗадолженности.ДатаВозникновения КАК ДатаВозникновения,
	|	МАКСИМУМ(ТекущиеЗадолженности.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	ТекущиеЗадолженности.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ТекущиеЗадолженности.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	МАКСИМУМ(ТекущиеЗадолженности.СуммаПлатежа) КАК СуммаПлатежа
	|ИЗ
	|	(ВЫБРАТЬ
	|		&ПараметрФактические КАК ТипЗадолженности,
	|		РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	|		РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК ДатаВозникновения,
	|		РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель КАК СуммаВзаиморасчетов,
	|		КурсыДоговоры.Курс КАК КурсВзаиморасчетов,
	|		КурсыДоговоры.Кратность КАК КратностьВзаиморасчетов,
	|		РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов = &ВалютаДокумента
	|					ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель
	|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов = &ВалютаДокумента
	|						И НЕ КурсыДоговоры.Курс = 0
	|						И НЕ &КурсДокумента = 0
	|					ТОГДА ВЫБОР
	|							КОГДА &флЕС
	|								ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель * &КурсДокумента * КурсыДоговоры.Кратность / (КурсыДоговоры.Курс * &КратностьДокумента)
	|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель * КурсыДоговоры.Курс * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаПлатежа,
	|		ЛОЖЬ КАК ДвиженияДокумента
	|	ИЗ
	|		ВзаиморасчетыОстатки КАК РасчетыСКонтрагентамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	|			ПО РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	|	ГДЕ
	|		РасчетыСКонтрагентамиОстатки.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом)
	|		И &ТипЗадолженностиМножитель * РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&ПараметрФактические,
	|		РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	|		РасчетыСКонтрагентамиОстатки.Сделка,
	|		ПоследнееДвижение.Период,
	|		РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель,
	|		КурсыДоговоры.Курс,
	|		КурсыДоговоры.Кратность,
	|		РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов,
	|		ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов = &ВалютаДокумента
	|					ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель
	|				КОГДА НЕ РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов = &ВалютаДокумента
	|						И НЕ КурсыДоговоры.Курс = 0
	|						И НЕ &КурсДокумента = 0
	|					ТОГДА ВЫБОР
	|							КОГДА &флЕС
	|								ТОГДА РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель * &КурсДокумента * КурсыДоговоры.Кратность / (КурсыДоговоры.Курс * &КратностьДокумента)
	|							ИНАЧЕ РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель * КурсыДоговоры.Курс * &КратностьДокумента / (&КурсДокумента * КурсыДоговоры.Кратность)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2)),
	|		ЛОЖЬ
	|	ИЗ
	|		ВзаиморасчетыОстатки КАК РасчетыСКонтрагентамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПлатежа, ) КАК КурсыДоговоры
	|			ПО РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов = КурсыДоговоры.Валюта
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(РасчетыСКонтрагентами.Период) КАК Период,
	|				РасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	|			ИЗ
	|				РегистрНакопления.уатВзаиморасчетыСКонтрагентами КАК РасчетыСКонтрагентами
	|			ГДЕ
	|				РасчетыСКонтрагентами.Активность = ИСТИНА
	|				И РасчетыСКонтрагентами.ВидДвижения = &ВидДвижения
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РасчетыСКонтрагентами.ДоговорКонтрагента) КАК ПоследнееДвижение
	|			ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ПоследнееДвижение.ДоговорКонтрагента
	|	ГДЕ
	|		РасчетыСКонтрагентамиОстатки.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом)
	|		И &ТипЗадолженностиМножитель * РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&ПараметрДвижения,
	|		ТЧДокументаПлатежа.ДоговорКонтрагента,
	|		ТЧДокументаПлатежа.Сделка,
	|		ВЫБОР
	|			КОГДА НЕ ТЧДокументаПлатежа.Сделка = НЕОПРЕДЕЛЕНО
	|				ТОГДА ТЧДокументаПлатежа.Сделка.Дата
	|			ИНАЧЕ ТЧДокументаПлатежа.Ссылка.Дата
	|		КОНЕЦ,
	|		ТЧДокументаПлатежа.СуммаВзаиморасчетов,
	|		ТЧДокументаПлатежа.КурсВзаиморасчетов,
	|		ТЧДокументаПлатежа.КратностьВзаиморасчетов,
	|		ВЫБОР
	|			КОГДА ТЧДокументаПлатежа.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ТОГДА ТЧДокументаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ИНАЧЕ ТЧДокументаПлатежа.ВалютаВзаиморасчетов
	|		КОНЕЦ,
	|		ТЧДокументаПлатежа.СуммаПлатежа,
	|		ИСТИНА
	|	ИЗ
	|		Документ.уатПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ТЧДокументаПлатежа
	|	ГДЕ
	|		&ДокументУказан
	|		И ТЧДокументаПлатежа.Ссылка = &Регистратор
	|		И ТЧДокументаПлатежа.Ссылка.Проведен) КАК ТекущиеЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеЗадолженности.ТипЗадолженности,
	|	ТекущиеЗадолженности.ДоговорКонтрагента,
	|	ТекущиеЗадолженности.ВалютаВзаиморасчетов,
	|	ТекущиеЗадолженности.Сделка,
	|	ТекущиеЗадолженности.КурсВзаиморасчетов,
	|	ТекущиеЗадолженности.КратностьВзаиморасчетов,
	|	ТекущиеЗадолженности.ДатаВозникновения");
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВозникновения " + ?(ОбработкаОбъект.СпособЗаполнения = "ФИФО", "Возр", "Убыв") + ",
	|	Сделка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "уатПлатежноеПоручениеВходящее", ДокументСсылка.Метаданные().Имя);
	
	Если СтруктураПараметров.Свойство("ОтборыПоДоговорам") И СтруктураПараметров.ОтборыПоДоговорам.Количество() > 0 Тогда
		ИндексОтбора = 1;
		Для Каждого ТекОтбор Из СтруктураПараметров.ДопОтборы Цикл 
			ТекИмяПараметра  = "Значение" + Формат(ИндексОтбора, "ЧГ=");
			ДопСтрокаОтборов = ДопСтрокаОтборов + " И " + ПолучитьСтрокуОтбораПоДоговорам(ТекОтбор.ВидСравнения, "&" + ТекИмяПараметра, Строка(ТекОтбор.ЛевоеЗначение));
			
			Запрос.УстановитьПараметр(ТекИмяПараметра, ТекОтбор.ПравоеЗначение);
			
			ИндексОтбора = ИндексОтбора + 1;
		КонецЦикла;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборыПоДоговорам", ДопСтрокаОтборов);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПараметрФактические", "Фактические");
	Запрос.УстановитьПараметр("Организация"        , ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Контрагент"         , Контрагент);
	Запрос.УстановитьПараметр("ВалютаДокумента"    , ВалютаДокумента);
	Запрос.УстановитьПараметр("КурсДокумента"      , КурсДокумента);
	Запрос.УстановитьПараметр("КратностьДокумента" , КратностьДокумента);
	Запрос.УстановитьПараметр("ВидДвижения"        , ?(ТипЗадолженности="<0", ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход));
	Запрос.УстановитьПараметр("ТипЗадолженностиМножитель", ?(ТипЗадолженности="<0", -1, 1));
	Запрос.УстановитьПараметр("ДатаПлатежа"        , ДатаДок);
	Запрос.УстановитьПараметр("Регистратор"        , ?(ДокументСсылка = Неопределено, Неопределено, ДокументСсылка.Ссылка));
	Запрос.УстановитьПараметр("ПараметрОперативные", "Оперативные");
	Запрос.УстановитьПараметр("ПараметрДвижения"   , "Текущий документ");
	Запрос.УстановитьПараметр("ДокументУказан"     , ЗначениеЗаполнено(ДокументСсылка));
	Если ТипЗнч(ДокументСсылка.Ссылка) = Тип("ДокументСсылка.уатПлатежноеПоручениеВходящее")
	 Или ТипЗнч(ДокументСсылка.Ссылка) = Тип("ДокументСсылка.уатПриходныйКассовыйОрдер") Тогда 
		мВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	Иначе
		мВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидДоговора"        , мВидДоговора);
	Запрос.УстановитьПараметр("флЕС"               , флЕС);
	Запрос.УстановитьПараметр("ОтборыПоДоговорам"  , Истина);
	
	Если ДокументСсылка.Метаданные().Имя = "уатЗаявкаНаРасходованиеДС" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"ВЫБОР
			|			КОГДА ТЧДокументаПлатежа.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
			|				ТОГДА ТЧДокументаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов
			|			ИНАЧЕ ТЧДокументаПлатежа.ВалютаВзаиморасчетов
			|		КОНЕЦ",
			"ТЧДокументаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов");
	КонецЕсли;
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Если ЕстьПодбор Тогда
		// убираем из таблицы значения, уже присутствующие в форме документа
		Для Каждого СтрокаДок Из ДокументРасшифровкаПлатежа Цикл
			
			МассивКУдалению = Новый Массив;
			
			СуммаПлатежаДок        = СтрокаДок.СуммаПлатежа;
			СуммаВзаиморасчетовДок = СтрокаДок.СуммаВзаиморасчетов;
			
			СтруктураПоиска=Новый Структура;
			СтруктураПоиска.Вставить("ДоговорКонтрагента", СтрокаДок.ДоговорКонтрагента);
			СтруктураПоиска.Вставить("Сделка"            , СтрокаДок.Сделка);
			
			МассивПодбора = ТабРезультат.НайтиСтроки(СтруктураПоиска);
			
			Для Индекс = 0 По МассивПодбора.Количество()-1 Цикл
				
				СтрокаПодбор = МассивПодбора[Индекс];
				
				Если СтрокаПодбор.СуммаПлатежа >= СуммаПлатежаДок И СтрокаПодбор.СуммаВзаиморасчетов >= СуммаВзаиморасчетовДок Тогда
					
					СтрокаПодбор.СуммаПлатежа        = СтрокаПодбор.СуммаПлатежа-СуммаПлатежаДок;
					СтрокаПодбор.СуммаВзаиморасчетов = СтрокаПодбор.СуммаВзаиморасчетов-СуммаВзаиморасчетовДок;
					
					СуммаПлатежаДок        = 0;
					СуммаВзаиморасчетовДок = 0;
					
				ИначеЕсли СтрокаПодбор.СуммаПлатежа>0 И СтрокаПодбор.СуммаВзаиморасчетов>0 Тогда
					
					СуммаСписанияПлатеж  = Мин(СуммаПлатежаДок,СтрокаПодбор.СуммаПлатежа);
					СуммаСписанияРасчеты = Мин(СуммаВзаиморасчетовДок,СтрокаПодбор.СуммаВзаиморасчетов);
					
					СтрокаПодбор.СуммаПлатежа        = СтрокаПодбор.СуммаПлатежа-СуммаСписанияПлатеж;
					СтрокаПодбор.СуммаВзаиморасчетов = СтрокаПодбор.СуммаВзаиморасчетов-СуммаСписанияРасчеты;
					
					СуммаПлатежаДок        = СуммаПлатежаДок-СуммаСписанияПлатеж;
					СуммаВзаиморасчетовДок = СуммаВзаиморасчетовДок-СуммаСписанияРасчеты;
					
				КонецЕсли;
				
				Если Не (СтрокаПодбор.СуммаВзаиморасчетов=0 Или СтрокаПодбор.СуммаПлатежа=0) Тогда
					Если КратностьДокумента=0 Тогда
						СтрокаПодбор.КурсВзаиморасчетов = 0;
					Иначе
						Если флЕС Тогда
							СтрокаПодбор.КурсВзаиморасчетов = Окр((СтрокаПодбор.СуммаПлатежа * КратностьДокумента
								/(СтрокаПодбор.СуммаВзаиморасчетов * КурсДокумента * СтрокаПодбор.КратностьВзаиморасчетов)), 4);
						Иначе 
							СтрокаПодбор.КурсВзаиморасчетов = Окр((СтрокаПодбор.СуммаПлатежа * КурсДокумента * СтрокаПодбор.КратностьВзаиморасчетов
								/(СтрокаПодбор.СуммаВзаиморасчетов * КратностьДокумента)), 4);
						КонецЕсли;
					КонецЕсли;
				Иначе
					
					МассивКУдалению.Добавить(СтрокаПодбор);
					
				КонецЕсли;
				
				Если СуммаПлатежаДок = 0 И СуммаВзаиморасчетовДок = 0 Тогда
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого Строка Из МассивКУдалению Цикл
				
				ТабРезультат.Удалить(Строка);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	уатОбщегоНазначенияТиповые.ЗагрузитьВТаблицуЗначений(ТабРезультат, ТабРасшифровка);
	
	ОбработкаОбъект.РасшифровкаПлатежа.Загрузить(ТабРасшифровка);
КонецПроцедуры

// Функция возвращает Строку Вида отбора для запроса
// 
// Параметры
// ВыбВидСравнения       - ВидСравнения
// ЗначениеОтбора        - Значение отбора запроса
// СтрокаПоляОтбора      - Строка, Аргумент запроса, т.е. то что должно быть написано до вида сравнения
// ЗначениеОтбораС       - Произвольный, значение отбора для видов сравнения, у которых необходимо 
//							указывать два значения, начальное значение
// ЗначениеОтбораПо      - Произвольный, значение отбора для видов сравнения, у которых необходимо
//							указывать два значения, конечное значение
// СамоЗначение          - Значение отбора запроса
// СамоЗначениеС         - Произвольный, значение отбора для видов сравнения, у которых необходимо 
//							указывать два значения, начальное значение
// СамоЗначениеПо        - Произвольный, значение отбора для видов сравнения, у которых необходимо
//							указывать два значения, начальное значение
//
// Возвращаемое значение 
//  Строка для запроса
//
Функция ПолучитьСтрокуОтбораПоДоговорам(ВыбВидСравнения, ЗначениеОтбора, СтрокаПоляОтбора, ЗначениеОтбораС = Неопределено, 
		ЗначениеОтбораПо = Неопределено, СамоЗначение = Неопределено, СамоЗначениеС = Неопределено, 
		СамоЗначениеПо = Неопределено)
	
	СтрокаВозврата = "";
	Если ВыбВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" = " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" <> " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" В (" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии 
		ИЛИ ВыбВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" В ИЕРАРХИИ(" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" НЕ В (" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии 
		ИЛИ ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" НЕ В ИЕРАРХИИ(" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		Если НЕ (ТипЗнч(СамоЗначение) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначение)) Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" < " + ЗначениеОтбора);
		КонецЕсли; 
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		Если НЕ (ТипЗнч(СамоЗначение) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначение)) Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" <= " + ЗначениеОтбора);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтрокаВозврата;
	
КонецФункции // ПолучитьСтрокуОтбораПоДоговорам()

#КонецОбласти
